gmtcontrol/nuttx/arch/arm/src/ra6m5/hardware/ra6m5_usb.h
/****************************************************************************
 * arch/arm/src/ra6m5/hardware/ra6m5_usb.h
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_RA6M5_HARDWARE_RA6M5_USB_H
#define __ARCH_ARM_SRC_RA6M5_HARDWARE_RA6M5_USB_H

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>
#include "chip.h"

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#ifdef USB_PID_STALL
#undef USB_PID_STALL
#endif 
#ifdef USB_PID_BUF
#undef USB_PID_BUF
#endif 
#ifdef USB_PID_NAK
#undef USB_PID_NAK
#endif 

#define USB_NULL            (0UL)
#define USB_NULLPTR         ((void*)0UL)
#define USB_ERROR           (0xffUL)
#define USB_TRUE            (1UL)
#define USB_FALSE           (0UL)
#define USB_YES             (1UL)
#define USB_NO              (0UL)

#define USB_CUSE            (0)
#define USB_D0USE           (1)
#define USB_D1USE           (2)

#define USB_DCPMAXP         (64u)
#define USB_MAX_EP_NO       (15u)       /* EP0 EP1 ... EP15 */
#define USB_CLASS           (0x0020u)
#define USB_VENDOR          (0x0040u)
#define USB_BUF2FIFO        (0x0010u)   /* Buffer --> FIFO */
#define USB_FIFO2BUF        (0x0000u)
#define USB_ENDPOINT_HALT   (0x0000u)
#define USB_TYPFIELD        (0xC000u)   /* Transfer type */
#define USB_PERIODIC        (0x8000u)   /* Periodic pipe */
#define USB_TYPFIELD_ISO    (0xC000u)   /* Isochronous */
#define USB_TYPFIELD_INT    (0x8000u)   /* Interrupt */
#define USB_TYPFIELD_BULK   (0x4000u)   /* Bulk */
#define USB_CNTMDFIELD      (0x0100U)   /* Continuous transfer mode select */
#define USB_CFG_CNTMDON     (0x0100U)
#define USB_CFG_CNTMDOFF    (0x0000U)
#define USB_INT_BRDY        (0x0001u)
#define USB_DIR_P_IN        (0x0010u)   /* PERI IN */
#define USB_DIR_P_OUT       (0x0000u)   /* PERI OUT */
#define USB_DIRFIELD        (0x0010u)   /* Transfer direction select */
#define USB_GS_BUSPOWERD    (0)
#define USB_GS_SELFPOWERD   (1)
#define USB_GS_HALT         (1)
#define USB_GS_REMOTEWAKEUP (2)
#define USB_CFG_DBLBON      (0x0200u)
#define USB_CFG_DBLBOFF     (0x0000u)
#define USB_CFG_DBLB        (USB_CFG_DBLBON)
#define USB_SHTNAKFIELD     (0x0080u)   /* Transfer end NAK */
#define USB_FRMNUM_VAL      (0x1111111111)
#define USB_PIPE_ALL        (0x3ff)
#define USB_EPNUMFIELD      (0x000Fu)   /* Endpoint number select */

#define USB_BITSET(x)       ((uint16_t)((uint16_t)1 << (x)))

#define INTSTS0_BIT_VALUES_TO_DETECT    (0x9d00)

#define USB_HSCONNECT     (0x00C0u)     /* Hi-Speed connect */
#define USB_FSCONNECT     (0x0080u)     /* Full-Speed connect */
#define USB_LSCONNECT     (0x0040u)     /* Low-Speed connect */
#define USB_NOCONNECT     (0x0000u)

#define USB_ATTACH        (0x0040)
#define USB_ATTACHL       (0x0041)
#define USB_ATTACHF       (0x0042)
#define USB_DETACH        (0x0043)
#define USB_SUSPEND       (0x0045)

/* Bit fields of pipe selection/ control registers. These bit fields are
 * generic
 */

#define USB_PIPE0         (0)
#define USB_PIPE1         (1)
#define USB_PIPE2         (2)
#define USB_PIPE3         (3)
#define USB_PIPE4         (4)
#define USB_PIPE5         (5)
#define USB_PIPE6         (6)
#define USB_PIPE7         (7)
#define USB_PIPE8         (8)
#define USB_PIPE9         (9)
#define USB_MIN_PIPE_NO   (1)
#define USB_MAX_PIPE_NO   (9)
#define USB_MAXPIPE_NUM   (9)

/* Transfer status Type */

#define USB_CTRL_END      (0u)
#define USB_DATA_NONE     (1u)
#define USB_DATA_WAIT     (2u)
#define USB_DATA_OK       (3u)
#define USB_DATA_SHT      (4u)
#define USB_DATA_OVR      (5u)
#define USB_DATA_STALL    (6u)
#define USB_DATA_ERR      (7u)
#define USB_DATA_STOP     (8u)
#define USB_DATA_TMO      (9u)
#define USB_CTRL_READING  (17u)
#define USB_CTRL_WRITING  (18u)
#define USB_DATA_READING  (19u)
#define USB_DATA_WRITING  (20u)
#define USB_DATA_FIFO_ERR (21U)

/* FIFO read / write result */

#define USB_FIFOERROR     (USB_ERROR)   /* FIFO not ready */
#define USB_WRITEEND      (0x0000u)     /* End of write (but packet may not be outputting) */
#define USB_WRITESHRT     (0x0001u)     /* End of write (send short packet) */
#define USB_WRITING       (0x0002u)     /* Write continues */
#define USB_READEND       (0x0000u)     /* End of read */
#define USB_READSHRT      (0x0001u)     /* Insufficient (receive short packet) */
#define USB_READING       (0x0002u)     /* Read continues */
#define USB_READOVER      (0x0003u)     /* Buffer size over */


/* USB0 & USBHS Register definition */

/* System Configuration Control Register */
 #define USB_SCKE                  (0x0400U) /* b10: USB clock enable */
 #define USB_CNEN                  (0x0100U) /* b8: Single end receiver */
 #define USB_HSE                   (0x0080U) /* b7: Hi-speed enable */
 #define USB_DCFM                  (0x0040U) /* b6: Function select */
 #define USB_DRPD                  (0x0020U) /* b5: D+/D- pull down control */
 #define USB_DPRPU                 (0x0010U) /* b4: D+ pull up control */
 #define USB_DMRPU                 (0x0008U) /* b3: D- pull up control *//* For low speed */
 #define USB_USBE                  (0x0001U) /* b0: USB module enable */

/* CPU Bus Wait Register */
 #define USB_BWAIT                 (0x0F0FU) /* b3-0: Bus wait bit */
 #define USB_BWAIT_15              (0x0F0FU) /* 15 wait (access cycle 17) */
 #define USB_BWAIT_14              (0x0F0EU) /* 14 wait (access cycle 16) */
 #define USB_BWAIT_13              (0x0F0DU) /* 13 wait (access cycle 15) */
 #define USB_BWAIT_12              (0x0F0CU) /* 12 wait (access cycle 14) */
 #define USB_BWAIT_11              (0x0F0BU) /* 11 wait (access cycle 13) */
 #define USB_BWAIT_10              (0x0F0AU) /* 10 wait (access cycle 12) */
 #define USB_BWAIT_9               (0x0F09U) /*  9 wait (access cycle 11) */
 #define USB_BWAIT_8               (0x0F08U) /*  8 wait (access cycle 10) */
 #define USB_BWAIT_7               (0x0F07U) /*  7 wait (access cycle  9) */
 #define USB_BWAIT_6               (0x0F06U) /*  6 wait (access cycle  8) */
 #define USB_BWAIT_5               (0x0F05U) /*  5 wait (access cycle  7) */
 #define USB_BWAIT_4               (0x0F04U) /*  4 wait (access cycle  6) */
 #define USB_BWAIT_3               (0x0F03U) /*  3 wait (access cycle  5) */
 #define USB_BWAIT_2               (0x0F02U) /*  2 wait (access cycle  4) */
 #define USB_BWAIT_1               (0x0F01U) /*  1 wait (access cycle  3) */
 #define USB_BWAIT_0               (0x0F00U) /*  0 wait (access cycle  2) */
 #define USB_BWAIT_B11_B8_WRITE    (0x0F00U) /*  b11-b8: Reserved bit write */

/* System Configuration Status Register */
 #define USB_OVCMON                (0xC000U) /* b15-14: Over-current monitor */
 #define USB_OVCBIT                (0x8000U) /* b15-14: Over-current bit */
 #define USB_HTACT                 (0x0040U) /* b6: USB Host Sequencer Status Monitor */
 #define USB_SOFEA                 (0x0020U) /* b5: SOF monitor */
 #define USB_IDMON                 (0x0004U) /* b2: ID-pin monitor */
 #define USB_LNST                  (0x0003U) /* b1-0: D+, D- line status */
 #define USB_SE1                   (0x0003U) /* SE1 */
 #define USB_FS_KSTS               (0x0002U) /* Full-Speed K State */
 #define USB_FS_JSTS               (0x0001U) /* Full-Speed J State */
 #define USB_LS_JSTS               (0x0002U) /* Low-Speed J State */
 #define USB_LS_KSTS               (0x0001U) /* Low-Speed K State */
 #define USB_SE0                   (0x0000U) /* SE0 */

/* PLL Status Register */
 #define USB_PLLLOCK               (0x0001U)

