gmtcontrol/nuttx/arch/arm/src/ra6m5/hardware/ra6m5_usb.h
/* PHY Crosspoint Adjustment Register */
/* PHYSLEW */
 #define USB_SLEWF01      (0x0008U)     /* b3: Cross point adjustment bit 01 */
 #define USB_SLEWF00      (0x0004U)     /* b2: Cross point adjustment bit 00 */
 #define USB_SLEWR01      (0x0002U)     /* b1: Cross point adjustment bit 01 */
 #define USB_SLEWR00      (0x0001U)     /* b0: Cross point adjustment bit 00 */

/* Deep Standby USB Transceiver Control/Terminal Monitor Register */
/* DPUSR0R */
 #define USB_DVBSTS0      (0x00800000U) /* b23: USB0 VBUS input */
 #define USB_DOVCB0       (0x00200000U) /* b21: USB0 OVRCURB input */
 #define USB_DOVCA0       (0x00100000U) /* b20: USB0 OVRCURA input */
 #define USB_DM0          (0x00200000U) /* b17: USB0 D- input */
 #define USB_DP0          (0x00100000U) /* b16: USB0 D+ input */
 #define USB_FIXPHY0      (0x00000010U) /* b4: USB0 transceiver output fixed bit  */
 #define USB_DRPD0        (0x00000008U) /* b3: D+/D- pull down resistor control bit */
 #define USB_RPUE0        (0x00000002U) /* b1: DP pull up resistor control bit */
 #define USB_SRPC0        (0x00000001U) /* b0: USB0 single end receiver control bit */

/* Deep Standby USB Suspend/Resume Interrupt Register */
/* DPUSR1R */
 #define USB_DVBINT0      (0x00800000U) /* b23: USB0 VBUS monitor bit */
 #define USB_DOVRCRB0     (0x00200000U) /* b21: USB0 OVRCURB DM monitor bit */
 #define USB_DOVRCRA0     (0x00100000U) /* b20: USB0 OVRCURA DM monitor bit */
 #define USB_DMINT0       (0x00020000U) /* b17: USB0 DM monitor bit */
 #define USB_DPINT0       (0x00010000U) /* b16: USB0 DP monitor bit */
 #define USB_DVBSE0       (0x00000080U) /* b7: USB0 VBUS interrupt enable */
 #define USB_DOVRCRBE0    (0x00000020U) /* b5: USB0 OVRCURB interrupt enable */
 #define USB_DOVRCRAE0    (0x00000010U) /* b4: USB0 OVRCURA interrupt enable */
 #define USB_DMINTE0      (0x00000002U) /* b1: USB0 DM interrupt enable */
 #define USB_DPINTE0      (0x00000001U) /* b0: USB0 DP interrupt enable */

/**************************************************************************************************/

/********* USBHS Only *****************************************************************************/

/* Low Power Control Register */
/* LPCTRL */
 #define USB_HWUPM              (0x0080U)     /* b7:  */

/* Low Power Status Register */
/* LPSTS */
 #define USB_SUSPENDM           (0x4000U)     /* b14: UTMI SuspendM control */

/* PHY Single Access Read Data Register */
/* SPRDAT */
 #define USB_PHYRDAT            (0x00FFU)     /* PHY read data bit */

/* Battery Charging Control Register */
/* BCCTRL */
 #define USB_PDDETSTS           (0x0200U)     /* b9: PDDET status */
 #define USB_CHGDETSTS          (0x0100U)     /* b8: CHGDET status */
 #define USB_DCPMODE            (0x0020U)     /* b5: DCP mode  control */
 #define USB_VDMSRCE            (0x0010U)     /* b4: VDMSRC control */
 #define USB_IDPSINKE           (0x0008U)     /* b3: IDPSINK control */
 #define USB_VDPSRCE            (0x0004U)     /* b2: VDPSRC control */
 #define USB_IDMSINKE           (0x0002U)     /* b1: IDMSINK control */
 #define USB_IDPSRCE            (0x0001U)     /* b0: IDPSRC control */

/* Function L1 Control Register 1 */
/* PL1CTRL1 */
 #define USB_L1EXTMD            (0x4000U)     /* b14: PHY control mode */
 #define USB_DVSQEX             (0x0080U)     /* b7: DVSQ extension bit */
 #define USB_DVSQ               (0x0070U)     /* b6-4: Mirror of DVSQ */
 #define USB_L1NEGOMD           (0x0008U)     /* b3: L1 response negotiation control */
 #define USB_L1RESPMD           (0x0006U)     /* b2-1: L1 response mode */
 #define USB_L1RESPEN           (0x0001U)     /* b0: L1 response enable */

/* Function L1 Control Register 2 */
/* PL1CTRL2 */
 #define USB_HSRDMON            (0x0F00U)     /* b12: RWE monitor bit */
 #define USB_RWEMON             (0x1000U)     /* b11-8: HIRD monitor bit */

/* Host L1 Control Register 1 */
/* HL1CTRL1 */
 #define USB_L1STATUS           (0x0006U)     /* b2-1: L1 request completion state */
 #define USB_L1REQ              (0x0001U)     /* b0: L1 changes request bit
                                               */

/* Host L1 Control Register 2 */
/* HL1CTRL2 */
 #define USB_BESL               (0x8000U)     /* b15: BESL & Alternate HIRD bit */
 #define USB_L1RWE              (0x1000U)     /* b12: L1 RemoteWake enable for LPM tokens */
 #define USB_HSRD               (0x0F00U)     /* b11-8: HIRD bit for LPM tokens */
 #define USB_L1ADDR             (0x000FU)     /* b3-0: DeviceAddress for LPM tokens */

/* PHY Timing Register 1 */
/* PHYTRIM1 */
 #define USB_IMPOFFSET          (0x7000U)     /* b14-12: Terminator adjustment */
 #define USB_HSIUP              (0x0F00U)     /* b11-8: Output level setup of HS  */
 #define USB_PCOMPENB           (0x0080U)     /* b7: PVDD starting detection setup */
 #define USB_DFALL              (0x000CU)     /* b3-2: FS/LS falling output waveform compensation function setting */
 #define USB_DRISE              (0x0003U)     /* b1-0: FS/LS standup output waveform compensation function setting */

/* PHY Timing Register 2 */
/* PHYTRIM2 */
 #define USB_DIS                (0x7000U)     /* b14-12: Disconnect disregard level setup */
 #define USB_PDR                (0x0300U)     /* b9-8: HS output compensation function setting */
 #define USB_HSRXENMODE         (0x0080U)     /* b7: HS reception permission control mode setup */
 #define USB_SQU                (0x000FU)     /* b3-0: Squelch disregard level setup */

/* Deep Standby USB Register */
/* DPUSR0R */
 #define USB_DVBSTSHM           (0x00800000U) /* b23: VBUS input */
 #define USB_DOVCBHM            (0x00200000U) /* b21: OVRCURB input */
 #define USB_DOVCAHM            (0x00100000U) /* b20: OVRCURA input */

/* DPUSR1R */
 #define USB_DVBSTSH            (0x00800000U) /* b23: Interruption factor return display of VBUS */
 #define USB_DOVCBH             (0x00200000U) /* b21: Interruption factor return display of OVRCURB  */
 #define USB_DOVCAH             (0x00100000U) /* b20: Interruption factor return display of OVRCURA  */
 #define USB_DVBSTSHE           (0x00000080U) /* b7 : VBUS interrupt enable */
 #define USB_DOVCBHE            (0x00000020U) /* b5 : OVRCURB interrupt enable */
 #define USB_DOVCAHE            (0x00000010U) /* b4 : OVRCURA interrupt enable */

