gmtcontrol/nuttx/arch/arm/src/ra6m5/hardware/ra6m5_usb.h
/**************************************************************************************************/

/* DMAx Pin Configuration Register */
 #define USB_DREQA              (0x4000U) /* b14: Dreq active select */
 #define USB_BURST              (0x2000U) /* b13: Burst mode */
 #define USB_DACKA              (0x0400U) /* b10: Dack active select */
 #define USB_DFORM              (0x0380U) /* b9-7: DMA mode select */
 #define USB_CPU_ADR_RD_WR      (0x0000U) /* Address + RD/WR mode (CPU bus) */
 #define USB_CPU_DACK_RD_WR     (0x0100U) /* DACK + RD/WR (CPU bus) */
 #define USB_CPU_DACK_ONLY      (0x0180U) /* DACK only (CPU bus) */
 #define USB_SPLIT_DACK_ONLY    (0x0200U) /* DACK only (SPLIT bus) */
 #define USB_DENDA              (0x0040U) /* b6: Dend active select */
 #define USB_PKTM               (0x0020U) /* b5: Packet mode */
 #define USB_DENDE              (0x0010U) /* b4: Dend enable */
 #define USB_OBUS               (0x0004U) /* b2: OUTbus mode */

/* USB IO Register Reserved bit mask */
 #define INTSTS1_MASK           (0xD870U) /* INTSTS1 Reserved bit mask */
 #define BRDYSTS_MASK           (0x03FFU) /* BRDYSTS Reserved bit mask */
 #define NRDYSTS_MASK           (0x03FFU) /* NRDYSTS Reserved bit mask */
 #define BEMPSTS_MASK           (0x03FFU) /* BEMPSTS Reserved bit mask */

/* Register Offsets *********************************************************/

#define RA6M5_USB_SYSCFG_OFFSET         0x0000  /* System Configuration Control Register */
#define RA6M5_USB_SYSSTS0_OFFSET        0x0004  /* System Configuration Status Register 0 */
#define RA6M5_USB_DVSTCTR0_OFFSET       0x0008  /* Device State Control Register 0 */
#define RA6M5_USB_CFIFO_OFFSET          0x0014  /* CFIFO Port Register */
#define RA6M5_USB_D0FIFO_OFFSET         0x0018  /* D0FIFO Port Register */
#define RA6M5_USB_D1FIFO_OFFSET         0x001C  /* D1FIFO Port Register */
#define RA6M5_USB_CFIFOSEL_OFFSET       0x0020  /* CFIFO Port Select Register */
#define RA6M5_USB_CFIFOCTR_OFFSET       0x0022  /* CFIFO Port Control Register */
#define RA6M5_USB_D0FIFOSEL_OFFSET      0x0028  /* D0FIFO Port Select Register  */
#define RA6M5_USB_D1FIFOSEL_OFFSET      0x002C  /* D1FIFO Port Select Register  */
#define RA6M5_USB_D0FIFOCTR_OFFSET      0x002A  /* D0FIFO Port Control Register */
#define RA6M5_USB_D1FIFOCTR_OFFSET      0x002E  /* D1FIFO Port Control Register */
#define RA6M5_USB_INTENB0_OFFSET        0x0030  /* Interrupt Enable Register 0 */
#define RA6M5_USB_INTENB1_OFFSET        0x0032  /* Interrupt Enable Register 1 */
#define RA6M5_USB_BRDYENB_OFFSET        0x0036  /* BRDY Interrupt Enable Register */
#define RA6M5_USB_NRDYENB_OFFSET        0x0038  /* NRDY Interrupt Enable Register */
#define RA6M5_USB_BEMPENB_OFFSET        0x003A  /* BEMP Interrupt Enable Register */
#define RA6M5_USB_INTSTS0_OFFSET        0x0040  /* Interrupt Status Register 0 */
#define RA6M5_USB_INTSTS1_OFFSET        0x0042  /* Interrupt Status Register 1 */
#define RA6M5_USB_BRDYSTS_OFFSET        0x0046  /* BRDY Interrupt Status Register */
#define RA6M5_USB_NRDYSTS_OFFSET        0x0048  /* NRDY Interrupt Status Register */
#define RA6M5_USB_BEMPSTS_OFFSET        0x004A  /* BEMP Interrupt Status Register */
#define RA6M5_USB_FRMNUM_OFFSET         0x004C  /* Frame Number Register   */
#define RA6M5_USB_USBREQ_OFFSET         0x0054  /* USB Request Type Register */
#define RA6M5_USB_USBVAL_OFFSET         0x0056  /* USB Request Value Register */
#define RA6M5_USB_USBINDX_OFFSET        0x0058  /* USB Request Index Register */
#define RA6M5_USB_USBLENG_OFFSET        0x005A  /* USB Request Length Register */
#define RA6M5_USB_DCPCFG_OFFSET         0x005C  /* DCP Configuration Register */
#define RA6M5_USB_DCPMAXP_OFFSET        0x005E  /* DCP Maximum Packet Size Register */
#define RA6M5_USB_DCPCTR_OFFSET         0x0060  /* DCP Control Register */
#define RA6M5_USB_PIPESEL_OFFSET        0x0064  /* Pipe Window Select Register */
#define RA6M5_USB_PIPECFG_OFFSET        0x0068  /* Pipe Configuration Register */
#define RA6M5_USB_PIPEMAXP_OFFSET       0x006C  /* Pipe Maximum Packet Size Register */
#define RA6M5_USB_PIPEPERI_OFFSET       0x006E  /* Pipe Cycle Control Register */
#define RA6M5_USB_PIPE1CTR_OFFSET       0x0070  /* PIPE1 Control Registers */
#define RA6M5_USB_PIPE2CTR_OFFSET       0x0072  /* PIPE2 Control Registers */
#define RA6M5_USB_PIPE3CTR_OFFSET       0x0074  /* PIPE3 Control Registers */
#define RA6M5_USB_PIPE4CTR_OFFSET       0x0076  /* PIPE4 Control Registers */
#define RA6M5_USB_PIPE5CTR_OFFSET       0x0078  /* PIPE5 Control Registers */
#define RA6M5_USB_PIPE6CTR_OFFSET       0x007A  /* PIPE6 Control Registers */
#define RA6M5_USB_PIPE7CTR_OFFSET       0x007C  /* PIPE7 Control Registers */
#define RA6M5_USB_PIPE8CTR_OFFSET       0x007E  /* PIPE8 Control Registers */
#define RA6M5_USB_PIPE9CTR_OFFSET       0x0080  /* PIPE9 Control Registers */
#define RA6M5_USB_PIPE1TRE_OFFSET       0x0090  /* PIPE1 Transaction Counter Enable Register */
#define RA6M5_USB_PIPE1TRN_OFFSET       0x0092  /* PIPE1 Transaction Counter Register */
#define RA6M5_USB_PIPE2TRE_OFFSET       0x0094  /* PIPE2 Transaction Counter Enable Register */
#define RA6M5_USB_PIPE2TRN_OFFSET       0x0096  /* PIPE2 Transaction Counter Register */
#define RA6M5_USB_PIPE3TRE_OFFSET       0x0098  /* PIPE3 Transaction Counter Enable Register */
#define RA6M5_USB_PIPE3TRN_OFFSET       0x009A  /* PIPE3 Transaction Counter Register */
#define RA6M5_USB_PIPE4TRE_OFFSET       0x009C  /* PIPE4 Transaction Counter Enable Register */
#define RA6M5_USB_PIPE4TRN_OFFSET       0x009E  /* PIPE4 Transaction Counter Register */
#define RA6M5_USB_PIPE5TRE_OFFSET       0x00A0  /* PIPE5 Transaction Counter Enable Register */
#define RA6M5_USB_PIPE5TRN_OFFSET       0x00A2  /* PIPE5 Transaction Counter Register */
#define RA6M5_USB_PHYSLEW_OFFSET        0x00F0  /* USB PHY Cross Point Adjustment Register */

/* Register Bitfield Definitions ********************************************/

/*  DnFIFO Port Control Register */

#define USB_DXFIFOCTR_FRDY              (1 << 13)   /* Bit 13: FIFO Port Ready */

