gmtcontrol/nuttx/arch/arm/src/ra6m5/hardware/ra6m5_usb.h
/*  DCP Maximum Packet Size Register */

#define USB_DCPMAXP_MXPS_SHIFT          (0)         /* Bits[0:6]: Maximum Packet Size */
#define USB_DCPMAXP_MXPS_MASK           (127 << USB_DCPMAXP_MXPS_SHIFT)
#  define USB_DCPMAXP_MXPS(n)           (((n) << USB_DCPMAXP_MXPS_SHIFT) & USB_DCPMAXP_MXPS_MASK)

/*  Pipe Maximum Packet Size Register */

#define USB_PIPEMAXP_MXPS_SHIFT         (0)         /* Bits[0:10]: Maximum Packet Size */
#define USB_PIPEMAXP_MXPS_MASK          (2047 << USB_PIPEMAXP_MXPS_SHIFT)
#  define USB_PIPEMAXP_MXPS(n)          (((n) << USB_PIPEMAXP_MXPS_SHIFT) & USB_PIPEMAXP_MXPS_MASK)

/*  DnFIFO Port Select Register */

#define USB_DFIFOSEL_BIGEND             (1 << 8)    /* Bit 8 : FIFO Port Endian Control */
#define USB_DFIFOSEL_MBW                (1 << 10)   /* Bit 10: FIFO Port Access Bit Width */

/*  CFIFO Port Control Register */

#define USB_CFIFOCTR_DTLN_SHIFT         (0)         /* Bits[0:8]: Receive Data Length */
#define USB_CFIFOCTR_DTLN_MASK          (511 << USB_CFIFOCTR_DTLN_SHIFT)
#  define USB_CFIFOCTR_DTLN(n)          (((n) << USB_CFIFOCTR_DTLN_SHIFT) & USB_CFIFOCTR_DTLN_MASK)
#define USB_CFIFOCTR_FRDY               (1 << 13)   /* Bit 13: FIFO Port Ready  */
#define USB_CFIFOCTR_BCLR               (1 << 14)   /* Bit 14: CPU Buffer Clear  */
#define USB_CFIFOCTR_BVAL               (1 << 15)   /* Bit 15: Buffer Memory Valid Flag */

/*  Pipe Configuration Register */

#define USB_PIPECFG_EPNUM_SHIFT         (0)         /* Bits[0:3]: Endpoint Number* */
#define USB_PIPECFG_EPNUM_MASK          (15 << USB_PIPECFG_EPNUM_SHIFT)
#  define USB_PIPECFG_EPNUM(n)          (((n) << USB_PIPECFG_EPNUM_SHIFT) & USB_PIPECFG_EPNUM_MASK)

#define USB_PIPECFG_DIR                 (1 << 4)    /* Bit 4 : Transfer Direction */
#define USB_PIPECFG_SHTNAK              (1 << 7)    /* Bit 7 : ipe Disabled at End of Transfer */
#define USB_PIPECFG_TYPE_SHIFT          (14)         /* Bits[14:15]: Transfer Type */
#define USB_PIPECFG_TYPE_MASK           (3 << USB_PIPECFG_TYPE_SHIFT)
#  define USB_PIPECFG_TYPE(n)           (((n) << USB_PIPECFG_TYPE_SHIFT) & USB_PIPECFG_TYPE_MASK)

/*  Interrupt Status Register 0 */

#define USB_INTSTS0_CTSQ_SHIFT          (0)         /* Bits[0:2]: Control Transfer Stage */
#define USB_INTSTS0_CTSQ_MASK           (7 << USB_INTSTS0_CTSQ_SHIFT)
#  define USB_INTSTS0_CTSQ(n)           (((n) << USB_INTSTS0_CTSQ_SHIFT) & USB_INTSTS0_CTSQ_MASK)
#define USB_INTSTS0_VALID               (1 << 3)    /* Bit 3 : USB Request Reception */
#define USB_INTSTS0_DVSQ_SHIFT          (4)         /* Bits[4:6]: Device State */
#define USB_INTSTS0_DVSQ_MASK           (7 << USB_INTSTS0_DVSQ_SHIFT)
#  define USB_INTSTS0_DVSQ(n)           (((n) << USB_INTSTS0_DVSQ_SHIFT) & USB_INTSTS0_DVSQ_MASK)
#define USB_INTSTS0_VBSTS               (1 << 7)    /* Bit 7 : VBUS Input Status */
#define USB_INTSTS0_BRDY                (1 << 8)    /* Bit 8 : Buffer Ready Interrupt Status */
#define USB_INTSTS0_NRDY                (1 << 9)    /* Bit 9 : Buffer Not Ready Interrupt Status */
#define USB_INTSTS0_BEMP                (1 << 10)   /* Bit 10: Buffer Empty Interrupt Status */
#define USB_INTSTS0_CTRT                (1 << 11)   /* Bit 11: Control Transfer Stage Transition Interrupt Status */
#define USB_INTSTS0_DVST                (1 << 12)   /* Bit 12: Device State Transition Interrupt Status */
#define USB_INTSTS0_SOFR                (1 << 13)   /* Bit 13: Frame Number Refresh Interrupt Status */
#define USB_INTSTS0_RESM                (1 << 14)   /* Bit 14: Resume Interrupt Status */
#define USB_INTSTS0_VBINT               (1 << 15)   /* Bit 15: VBUS Interrupt Status */

/*  Interrupt Status Register 1 */

#define USB_INTSTS1_PDDETINT            (1 << 0)    /* Bits 0 : PDDET Detection Interrupt Status Flag */
#define USB_INTSTS1_SACK                (1 << 4)    /* Bits 4 : Setup Transaction Normal Response Interrupt Status */
#define USB_INTSTS1_SIGN                (1 << 5)    /* Bits 5 : Setup Transaction Error Interrupt Status */
#define USB_INTSTS1_EOFERR              (1 << 6)    /* Bits 6 : EOF Error Detection Interrupt Status */
#define USB_INTSTS1_ATTCH               (1 << 11)   /* Bits 11: ATTCH Interrupt Status */
#define USB_INTSTS1_DTCH                (1 << 12)   /* Bits 12: USB Disconnection Detection Interrupt Status */
#define USB_INTSTS1_BCHG                (1 << 14)   /* Bits 14: USB Bus Change Interrupt Status */
#define USB_INTSTS1_OVRCR               (1 << 15)   /* Bits 15: Overcurrent Input Change Interrupt Status */

/*  PIPEn Transaction Counter Enable Register */

#define USB_PIPETRE_TRCLR               (1 << 8)    /* Bits 8 : Transaction Counter Clear */
#define USB_PIPETRE_TRENB               (1 << 9)    /* Bits 9 : Transaction Counter Enable */

/*  CFIFO Port Select Register */

#define USB_CFIFOSEL_ISEL               (1 << 5)    /* Bits 5 : CFIFO Port Access Direction When DCP Is Selected */

#endif /* __ARCH_ARM_SRC_RA6M5_HARDWARE_RA6M5_USB_H */
